// ЗАДАЧКА

// Визначте змінні str, num, flag і txt зі значеннями «Привіт», 123, true, «true». 
// За допомогою оператора визначення типу виведіть в консоль, які змінні належать типам:
//  string, number, boolean.


// let str = "Привіт";
// let num = 123;
// let flag = true; 
// let txt = "true";

// console.log(typeof(str));
// console.log(typeof(num));
// console.log(typeof(flag));
// console.log(typeof(txt));




// ЗАДАЧКА

// Створіть дві змінні, в яких буде зберігатись ваш вік і вік вашого друга. 
// Сумму двох змінних виведіть на екран за допомогою console.log()

// let my_age = 15; 
// let his_age = 16;
// let total_age = my_age + his_age;
// console.log(total_age);



// ЗАДАЧКА

// Написати скрипт, який виводить в консоль добуток двох змінних a і b.

// a = 1; 
// b = 2; 
// console.log(a + b);


// ЗАДАЧКА

// Виведіть в консоль через кому рядок “Я навчаюся в GoITeens в групі: ”
//  і змінну group в якої значення це назва твоєї групи.


// let groupName = "Bombaleo";

// console.log("Я навчаюся в GoITeens в групі: " + groupName);


// ЗАДАЧКА

// За допомогою prompt запитайте ім’я користувача.
//  Отримане значення виведіть в консоль.

// let userName = prompt(); 
// console.log(userName);




// Оголоси дві змінні, які зберігають назву та ціну товару: name і price. 
// Присвойте змінним наступні характеристики товару (відразу при оголошенні) назва: MacBook Pro 13″, ціна: 100000
// Використовуючи стандартний рядок виведи в консоль інформацію про товар, вийде: 'Обрано «MacBook Pro 13″»,
//  ціна за штуку 10000 кредитів'. Присвой товару нову ціну - 20000. 
//  Використовуючи стандартний рядок виведи в консоль інформацію про товар,
//  вийде: 'Обрано «MacBook Pro 13″», ціна за штуку 2000 кредитів'.

// let productName = "MacBook Pro 13"; 
// let price = 10000; 

// console.log("Обрано " + productName + "."  + " Ціна за штуку: " + price + " Кредитів");

// price = 2000; 

// console.log("Обрано " + productName + "."  + " Ціна за штуку: " + price + " Кредитів");



// confirm("Will you buy this MacBook? 😉👾"); 


// let card_number = prompt("Your card number: "); 
// console.log(card_number);

// let cvv_code = prompt("Your CVV2: ");
// console.log(cvv_code);

// let date = prompt("Your 00/00: " );
// console.log(date);

// confirm("💰"); 
// console.log("$_$")



